Revit 2018 API
Camera Class
 A collection of camera settings
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2017
Syntax
C#
public class Camera : IDisposable
Visual Basic
Public Class Camera _
	Implements IDisposable
Visual C++
public ref class Camera : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.Camera
See Also
Camera Members
Autodesk.Revit.DB.DirectContext3D Namespace